package chinese_calendar

import (
	"testing"
	"time"

	"github.com/stretchr/testify/require"
)

func TestJulianDayNumber(t *testing.T) {
	t.Run("haha", func(t *testing.T) {
		// 测试用例来自于<<Astronomical Algorithms>>第二版
		cases := map[float64][6]int{
			2451545.0:  {2000, 1, 1, 12, 0, 0},
			2451179.5:  {1999, 1, 1, 0, 0, 0},
			2446822.5:  {1987, 1, 27, 0, 0, 0},
			2446966.0:  {1987, 6, 19, 12, 0, 0},
			2447187.5:  {1988, 1, 27, 0, 0, 0},
			2447332.0:  {1988, 6, 19, 12, 0, 0},
			2436116.31: {1957, 10, 4, 19, 26, 24},
			2415020.5:  {1900, 1, 1, 0, 0, 0},
			2305447.5:  {1600, 1, 1, 0, 0, 0},
			2305812.5:  {1600, 12, 31, 0, 0, 0},
			//2026871.8:  {837, 4, 10, 7, 12, 0},
			//1842713.0: {333, 1, 27, 12, 0, 0},
			//1676496.5: {-123, 12, 31, 0, 0, 0},
			//1676497.5: {-122, 1, 1, 0, 0, 0},
			//1356001.0: {-1000, 7, 12, 12, 0, 0},
			//1355866.5: {-1000, 2, 29, 0, 0, 0},
			//1355671.4: {-1001, 8, 17, 21, 36, 0},
			//0.0:       {-4712, 1, 1, 12, 0, 0},
		}

		for expect, date := range cases {
			require.Equal(t, expect, julianDay(time.Date(date[0], time.Month(date[1]), date[2], date[3], date[4], date[5], 0, time.UTC)))
		}

	})
}
